# 华氏摄氏转换代码
wd_sm = input(r"选择温度换算类型,‘F’华氏或者‘C’摄氏 " + '\n')  # 输入温度转换类型标识
wd_d = wd_sm.upper()  # 把输入的字符串强制转换成大写字母
wd = input("请输入当前温度:")  # 输入温度数字
wd_1 = float(wd)  # 强制把温度字符串转换为浮点数
wd_cl = 32  # 设置公式计算的常量，这一步可以省略
if wd_d == "F":  # if语句判断输入的温度类型是否是华氏，true就计算，false就执行后面的语句
    f1 = (wd_1 - wd_cl) / 1.8  # 换算公式
    print("当前温度是摄氏：%6.2f℃ " % f1)  # 格式化输出结果，保留小数点2位
elif wd_d == "C":  # if语句判断输入的温度类型是否是摄氏，true就计算，注意这里的不是else而是elif关键字
    c1 = wd_1 + wd_cl * 1.8
    print("当前温度是摄氏：%6.2f℉ " % c1)
    print("当前温度是摄氏:{0:^8.2f}℉ ".format(c1))
else:
    print("输入的温度类型错误！")
